Terraform plan in __.__ in the __test1__ workspace
With var files: `test1.tfvar`
<details>
  <summary>Plan: 4 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application.main will be created
  + resource "azuread_application" "main" {
      + app_role                = (known after apply)
      + application_id          = (known after apply)
      + display_name            = "demo1234"
      + homepage                = (known after apply)
      + id                      = (known after apply)
      + identifier_uris         = (known after apply)
      + name                    = (known after apply)
      + oauth2_permissions      = (known after apply)
      + object_id               = (known after apply)
      + owners                  = (known after apply)
      + prevent_duplicate_names = false
      + public_client           = (known after apply)
      + reply_urls              = (known after apply)
      + type                    = "webapp/api"
    }

  # azuread_service_principal.main will be created
  + resource "azuread_service_principal" "main" {
      + app_roles      = (known after apply)
      + application_id = (known after apply)
      + display_name   = (known after apply)
      + id             = (known after apply)
      + object_id      = (known after apply)

      + oauth2_permissions {
          + admin_consent_description  = (known after apply)
          + admin_consent_display_name = (known after apply)
          + id                         = (known after apply)
          + is_enabled                 = (known after apply)
          + type                       = (known after apply)
          + user_consent_description   = (known after apply)
          + user_consent_display_name  = (known after apply)
          + value                      = (known after apply)
        }
    }

  # azuread_service_principal_password.main will be created
  + resource "azuread_service_principal_password" "main" {
      + description          = (known after apply)
      + end_date             = (known after apply)
      + end_date_relative    = "8760h"
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # random_string.password must be replaced
-/+ resource "random_string" "password" {
      ~ id          = "********************************" -> (known after apply)
      ~ length      = 32 -> 40 # forces replacement
      ~ result      = "********************************" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 1 to destroy.
```
</details>

Plan generated in [terraform-plan #18](https://github.com/melkio/github-actions-and-terrraform/actions/runs/964688647)